#+title:  DTALC with improved type machinery
#+author: Simon Beaumont
#+email:  datalligator@icloud.com
#+STARTUP: inlineimages overview indent latexpreview

*** Let's give that a go...

#+begin_src haskell :tangle yes
  expr2 :: Expr (Mul :+: Add :+: Val)
  expr2 = val 4 ⊗ val 2000 ⊕ val 20 ⊕ val 2
#+end_src
#+begin_src haskell
  eval expr2
#+end_src

#+RESULTS:
: 8022

*** Running the algebra
#+begin_src haskell :tangle yes    
  run :: Run f => Term f a -> Mem -> (a, Mem)
  run = foldTerm (,) runAlgebra
#+end_src
#+begin_src haskell 
  run tick (Mem 4)
#+end_src

#+RESULTS:
| 4 | Mem | 5 |

